package cn.com.duiba.nezha.engine.api.enums;

/**
 * @author ElinZhou
 * @version $Id: RedisKey.java , v 0.1 2017/5/19 下午4:38 ElinZhou Exp $
 */
public enum RedisKey {

    /**
     * CPA广告点击计数
     */
    K37,


    /**
     * CPA广告计费累计
     */
    K38,


    /**
     * CPA广告转换次数累计
     */
    K39,


    /**
     * CPA广告点击分布式锁
     */
    K040,


    /**
     * 素材点击累计
     */
    K41,


    /**
     * 素材曝光累计
     */
    K42,


    /**
     * CPA最近点击记录
     */
    K43,


    /**
     * 标签对应的广告列表
     */
    KC119,

    /**
     * 广告统计特征
     */
    K44,

    /**
     * 广告素材排名
     */
    K045,

    /**
     * 广告融合统计数据
     */
    K46,

    /**
     * 广告分日统计数据
     */
    K47,

    /**
     * 广告分时统计数据
     */
    K48,

    /**
     * 广告调价因子key
     */
    K55,

    /**
     * 标签下的cvr分日数据
     */
    K060,

    /**
     * 标签下的cvr分时数据
     */
    K061,

    /**
     * 哪吒统计纠偏
     */
    K66,

    /**
     * 哪吒统计纠偏
     */
    K67,

    /**
     * 哪吒统计纠偏
     */
    K68,

    /**
     * 黑白名单
     */
    K73,

    /**
     * 新黑白名单数据
     */
    K75,

    /**
     * 候选集
     */
    K076,

    /**
     * 广告主预算消耗
     */
    K78,

    /**
     * 广告配置+媒体预算消耗信息
     */
    K79,

    /**
     * 广告配置+时段
     */
    K80,
    /**
     * 广告配置预算消耗
     */
    K81,
    /**
     * 广告消耗
     */
    K82,
    /**
     * 活动特征
     */
    K83,

    /**
     * 广告位上配置包的信息
     */
    K84,

    K85,

    /**
     * 全局配置的key
     */
    K86,
    ;




}
